app/Controllers/Carrito.php

    public function guardar()
{
    // Obtener los datos del producto desde la segunda vista
    $id = $this->request->getVar('id_producto');
    $nombre = $this->request->getVar('nombre');
    $precio = $this->request->getVar('precio');

    // Obtener id_user desde la sesión
    $id_user = session('user')->id_user;

    // Crear una instancia del modelo que representa el carrito
    $carrito = new Carritos();

    // Verificar si el producto ya está en el carrito para el usuario actual
    $producto_en_carrito = $carrito->where('id_producto', $id)
                                   ->where('id_user', $id_user)
                                   ->first();
---
SELECT *
FROM `carrito`
WHERE `id_producto` = '15'
AND `id_user` = '3'
 LIMIT 1

        ];

        // Insertar nuevo producto en el carrito
        $carrito->insert($datos);
---
INSERT INTO `carrito` (`id_user`, `id_producto`, `cantidad`) VALUES ('3', '15', 1)