app/Controllers/carrito2.php

SELECT `carrito`.*, `productos`.`nombre`, `productos`.`precio`, `productos`.`descripcion_prod`, `productos`.`imagen` as `producto_imagen`, `tipo`.`tipo` as `tipo_producto`
FROM `carrito`
JOIN `productos` ON `productos`.`id_producto` = `carrito`.`id_producto`
JOIN `tipo` ON `productos`.`id_tipoprod` = `tipo`.`id_tipoprod`
WHERE `id_user` = '3'
ORDER BY `id_carrito` ASC
---
    public function index()

    {
        $user = session('user');

        if (!$user || $user->id_user < 1) {
            return redirect()->to('login');
        } else {

        $car = new Carritos();

        // Obtener id_user desde la sesión
        $id_user = session('user')->id_user;

        // Obtener los datos del carrito y unirlos con los datos de los teclados
        $datos['carritos'] = $car->select('carrito.*, productos.nombre, productos.precio, productos.descripcion_prod, productos.imagen as producto_imagen, tipo.tipo as tipo_producto')
                                 ->join('productos', 'productos.id_producto = carrito.id_producto')
                                 ->join('tipo', 'productos.id_tipoprod = tipo.id_tipoprod')
                                 ->where('id_user', $id_user)
                                 ->orderBy('id_carrito', 'ASC')
                                 ->findAll();

SELECT *
FROM `carrito`
WHERE `carrito`.`id_carrito` = 94
---
    public function actualizarcar()
{
    $car = new Carritos();
    $productosModel = new Producto();

    // Obtener id_user desde la sesión
    $id_user = session('user')->id_user;

    // Obtener datos del formulario
    $cantidades = $this->request->getPost('cantidad');

    // Verificar si el carrito está vacío
    if (empty($cantidades)) {
        // Redirigir a la vista carrito2
        return redirect()->to(base_url('carrito2'));
    }

    foreach ($cantidades as $id_carrito => $cantidad) {
        // Validar que la cantidad sea un número entero positivo
        if (is_numeric($cantidad) && $cantidad > 0) {
            // Obtener los datos del carrito antes de actualizar
            $datosCar = $car->find($id_carrito);