app/Controllers/Productos.php

INSERT INTO `productos` (`nombre`, `precio`, `descripcion_prod`, `imagen`, `id_tipoprod`) VALUES ('prueba', '1.11', 'prueba', '1698098328_52de93e2efa2e7041713.png', '3')
---
            'imagen' => $nuevoNombre,
            'id_tipoprod' => $tipoProductoID, // Almacenar la ID del tipo de producto
        ];
        $producto->insert($datos);