app/Controllers/Teclados.php

SELECT *
FROM `teclados`
ORDER BY `id` ASC
---
    public function index(){

        $teclado = new Teclado();

        $datos['teclados'] = $teclado->orderBy('id', 'ASC')->findAll();