app/Controllers/Teclados.php

SELECT *
FROM `teclados`
ORDER BY `id_teclado` ASC
---
    public function index(){

        $user = session('user');

        if (!$user || $user->id_user < 1) {
            // El usuario no ha iniciado sesión, redirigir a la página de inicio de sesión
            return redirect()->to('/login');
        }

        // El usuario ha iniciado sesión, verificar su rol
        $rol = $user->rol;

        if ($rol == 1) {
            // Si el usuario tiene rol 1, cargar la vista listar
            $teclado = new Teclado();
            $datos['teclados'] = $teclado->orderBy('id_teclado', 'ASC')->findAll();