app/Models/Barrio.php

INSERT INTO `barrio` (`barrio`, `id_ciudad`) VALUES ('Castagnino', 59)
---
     public function insertBarrio($barrio,$id_ciudad)
     {
        return $this->insert(['barrio' => $barrio, 'id_ciudad' => $id_ciudad]);