app/Models/Calle.php

INSERT INTO `calle` (`calle`) VALUES ('alcantarilla')
---
     public function insertCalle($calle)
     {
         return $this->insert(['calle' => $calle]);