app/Models/Ciudad.php

     public function insertCiudad($ciudad,$id_provincia)
     {
        return $this->insert(['ciudad' => $ciudad, 'id_prov' => $id_provincia]);
---
INSERT INTO `ciudad` (`ciudad`, `id_prov`) VALUES ('almafuerte', 59)