app/Models/Compras.php

INSERT INTO `compras` (`id_user`, `id_metodo_pago`, `id_direccion_casa`, `total_c`) VALUES ('3', 1, 58, 149.99)
---
    public function insertCompra($id_user,$id_direccion,$totalCompra)
    {
        return $this->insert([
            'id_user' => $id_user,
            'id_metodo_pago' => 1, // ID del método de pago (ajusta según tus necesidades)
            'id_direccion_casa' => $id_direccion, // ID de la dirección (ajusta según tus necesidades)
            'total_c' => $totalCompra,
        ]);