app/Models/Detalle_compra.php

     public function insertDetallecompra($id_compra,$id_producto,$cantidad,$precio,$subtotal)
    {
        return $this->insert([
            'id_compras' => $id_compra,
            'id_producto' => $id_producto,
            'cantidad' => $cantidad,
            'precio_unitario' => $precio,
            'subtotal' => $subtotal
        ]);
---
INSERT INTO `detalle_compra` (`id_compras`, `id_producto`, `cantidad`, `precio_unitario`, `subtotal`) VALUES (57, '38', '1', '149.99', 149.99)