app/Models/Direccion_ca.php

INSERT INTO `direccion_ca` (`id_calle`, `codigo_postal`, `id_user`, `numero`, `descripcion_casa`, `id_barrio`) VALUES (24, '3434', '3', '4324', 'casa negra', 59)
---
     public function insertDireccion($id_calle,$codigo_postal,$id_user,$numero,$descripcion_casa,$id_barrio)
    {
        $this->insert([
        'id_calle' => $id_calle,'codigo_postal' => $codigo_postal,'id_user' => $id_user,'numero' => $numero,'descripcion_casa' => $descripcion_casa,'id_barrio' => $id_barrio,]);

SELECT `direccion_ca`.*, `pais`.`pais`, `provincia`.`provincia`, `ciudad`.`ciudad`, `barrio`.`barrio`, `calle`.`calle`
FROM `direccion_ca`
JOIN `calle` ON `calle`.`id_calle` = `direccion_ca`.`id_calle`
JOIN `barrio` ON `barrio`.`id_barrio` = `direccion_ca`.`id_barrio`
JOIN `ciudad` ON `ciudad`.`id_ciudad` = `barrio`.`id_ciudad`
JOIN `provincia` ON `provincia`.`id_prov` = `ciudad`.`id_prov`
JOIN `pais` ON `pais`.`id_pais` = `provincia`.`id_pais`
WHERE `id_user` = '3'
---
    public function getUserData($id_user)
    {
        $userData = $this->select('direccion_ca.*, pais.pais, provincia.provincia, ciudad.ciudad, barrio.barrio, calle.calle')
            ->join('calle', 'calle.id_calle = direccion_ca.id_calle')
            ->join('barrio', 'barrio.id_barrio = direccion_ca.id_barrio')
            ->join('ciudad', 'ciudad.id_ciudad = barrio.id_ciudad')
            ->join('provincia', 'provincia.id_prov = ciudad.id_prov')
            ->join('pais', 'pais.id_pais = provincia.id_pais')
            ->where('id_user', $id_user)
            ->findAll();