app/Models/Pais.php

INSERT INTO `pais` (`pais`) VALUES ('Argentina')
---
     public function insertPais($pais)
{
    return $this->insert(['pais' => $pais]);