app/Models/Producto.php

UPDATE `productos` SET `nombre` = 'PRO KEYBOARD', `precio` = '149.99', `descripcion_prod` = 'The tournament-proven PRO design, now with your choice of swappable pro-grade GX mechanical switches: Clicky, Tactile an', `id_tipoprod` = '3'
WHERE `productos`.`id_producto` IN ('38')
---
public function updateprod($datos,$id)
{
    $this->update($datos,$id);

SELECT *
FROM `productos`
WHERE `id_producto` = '38'
 LIMIT 1
---
public function obtenertodoslosprod()
{
    return $this->orderBy('id_producto', 'ASC')->findAll();