app/Models/Provincia.php

INSERT INTO `provincia` (`id_pais`, `provincia`) VALUES (59, 'Cordoba')
---
     public function insertProvincia($id_pais, $provincia)
     {
        return $this->insert(['id_pais' => $id_pais, 'provincia' => $provincia]);