app/Models/UserModel.php

    public function isEmailTaken($email)
{
    return $this->where('email', $email)->countAllResults() > 0;
---
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `email` = 'david@gmail.com'
AND `users`.`deleted_at` IS NULL

public function updatedashboard($userId, $data)
{
   $this->update($userId, $data);
---
UPDATE `users` SET `perfil` = '1701313482_0188a9f0c433c92a1992.gif'
WHERE `users`.`id_user` IN ('3')